[
    {
        "id": 1,
        "judul": "Pendahuluan",
        "arab": "الْحَمْدُ لِلَّهِ الَّذِي فَضْلَ بَنِي آدَمَ بِالْعِلْمِ وَالْعَمَلِ عَلَى جَمِيعِ الْعَالَمِ وَالصَّلَاةُ وَالسَّلَامُ عَلَى مُحَمَّدٍ سَيِّدِ الْعَرَبِ وَالْعَجَمِ. وَعَلَى آلِهِ وَأَصْحَابِهِ يَنَابِيْعِ الْعُلُوْمِ وَالْحِكَمِ. (وَبَعْدُ) فَلَمَّا رَأَيْتُ كَثِيْرًا مِنْ طُلا بِالْعِلْمِ فِي زَمَانِنَا يَجِدُّوْنَ إِلَى الْعِلْمِ وَلَا يَصِلُوْنَ. أَوْ مِنْ مَنَافِعِهِ وَثَمَرَاتِهِ وَهِيَ الْعَمَلُ بِهِ وَالنَّشْرُ يُحْرُمُوْنَ لِمَا أَنَّهُمْ أَخْطَؤُوْا طَرَائِقَهُ وَتَرَكُوْا شَرَائِطَهُ. وَكُلُّ مَنْ أَحْطَأَ الطَّرِيقَ ضَلَّ وَلَا يَنَالُ الْمَقْصُوْدَ قَلْ أَوْ جَلَّ. أَرَدْتُ وَأَحْبَبْتُ أَنْ أُبَيِّينَ لَهُمْ طَرِيقَ التَّعَلَّمَ عَلَى مَا رَأَيْتُ فِي الْكُتُبِ وَسَمِعْتُ مِنْ أَسَاتِيْذِي أُولِي الْعِلْمِ وَالْحِكَمِ. رَجَاءً الدُّعَاءَ لِي مِنَ الرَّاغِبِينَ فِيْهِ الْمُخْلَصِيْنَ بِالْفَوْزِ وَالْخَلَاصِ فِي يَوْمِ الدِّينِ بَعْدَ مَا اسْتَخَرْتُ اللَّهَ تَعَالَى فِيْهِ. وَسَمْيْتُهُ تَعْلِيمُ الْمُتَعَلِّمِ طَرِيقَ التَّعَلُّمِ) وَجَعَلْتُهُ فُصُولًا فَصْلٌ فِي مَاهِيَةِ الْعِلْمِ وَالْفِقْهِ وَفَضْلِهِ . فَضْلٌ فِي النِّيَّةِ فِي حَالِ التَّعَلَّم. فَصْلٌ فِي اخْتِيَارِ الْعِلْمِ وَالْأُسْتَاذِ وَالشَّرِيْكِ وَالثَّبَاتِ فَصْلٌ فِي تَعْظِيمِ الْعِلْمِ وَأَهْلِهِ. فَصْلٌ فِي الجِدِّ وَالْمُوَاظَبَةِ وَالْهِمَّةِ. فَصْلٌ فِي بِدَايَةِ السَّبَقُ وَقَدْرِهِ وَتَرْتِيبِهِ فَصْلٌ فِي التَّوَكَّلِ. فَصْلٌ فِي وَقْتِ التَّحْصِيلِ. فَضْلٌ فِي الشَّفَقَةِ وَالنَّصِيْحَةِ، فَضْلٌ فِي الْإِسْتِفَادَةِ. فَصْلٌ فِي الْوَرَعِ حَالَ التَّعَلُّمِ. فَصْلٌ فِيْمَا يُوْرِثُ الحِفْظُ وَالنِّسْيَانَ. فَصْلٌ فِيْمَا يَجْلِبُ الرِّزْقَ وَمَا يَمْنَعُهُ وَمَا يَزِيدُ فِي الْعُمْرِ وَمَا يَنْقُصُ. وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ عَلَيْهِ تَوَكَّلْتُ وَالَيْهِ أُنِيبُ.الْإِسْتِفَادَةِ. فَصْلٌ فِي الْوَرَعِ حَالَ التَّعَلُّمِ. فَصْلٌ فِيْمَا يُوْرِثُ الحِفْظُ وَالنِّسْيَانَ. فَصْلٌ فِيْمَا يَجْلِبُ الرِّزْقَ وَمَا يَمْنَعُهُ وَمَا يَزِيدُ فِي الْعُمْرِ وَمَا يَنْقُصُ وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ عَلَيْهِ تَوَكَّلْتُ وَالَيْهِ أُنِيبُ .",
        "terjemah": "Segala puji hanya milik Allah yang telah mengangkat derajat umat manusia dengan ilmu dan amal, atas seluruh alam. Salawat dan salam semoga tetap terlimpah atas Nabi Muhammad, pemimpin seluruh umat manusia, dan semoga pula tercurah atas keluarga dan para sahabatnya yang menjadi sumber ilmu dan hikmah. Kalau saya memperhatikan para pelajar (santri), sebenarnya mereka telah bersungguh-sungguh dalam mencari ilmu, tapi banyak dari mereka yang tidak memperoleh manfaat dari ilmunya, yakni berupa pengamalan ilmu tersebut dan menyebarkannya. Hal itu terjadi karena cara mereka menuntut ilmu salah, dan syarat-syaratnya mereka tinggalkan. Karena, barangsiapa salah jalan, tentu tersesat Tidak akan sampai kepada tujuan. Oleh karena itu saya ingin menjelaskan kepada para santri cara mencari ilmu, menurut kitab-kitab yang pernah saya baca dan menurut nasehat para guru saya, yang ahli ilmu dan hikmah. Dengan harapan semoga orang-orang yang tulus ikhlas mendoakan saya sehingga saya mendapatkan keuntungan dan keselamatan di akhirat. Begitu doa saya dalam salat Istikharah ketika akan menulis kitab ini. Kitab ini saya beri nama Ta'limul Muta'alim Thariqatta'allum. Yang terdiri dari tiga belas pasal Pertama, menerangkan hakikat ilmu, hukum mencari ilmu, dan keutamaannya Kedua, niat dalam mencari ilmu Ketiga, cara memilih ilmu, guru, teman, dan ketekunan Keempat, cara menghormati ilmu dan guru. Kelima, kesungguhan dalam mencari ilmu, beristiqamah dan cita-cita yang luhur. Keenam, ukuran dan urutannya. Ketujuh, tawakal Kedelapan, waktu belajar ilmu. Kesembilan, saling mengasihi dan saling menasehati. Kesepuluh, mencari tambahan ilmu pengetahuan. Kesebelas, bersikap wara' ketika menuntut ilmu. Keduabelas, hal-hal yang dapat menguatkan hafalan dan yang melemahkannya. Ketigabelas, hal-hal yang mempermudah datangnya rezeki, hal-hal yang menghambat datangnya rezeki, hal-hal yang dapat memperpanjang, dan mengurangi umur. Tidak ada penolong kecuali Allah, hanya kepada- Nya saya berserah diri, dan kehadirat-Nya aku akan kembali."
    }
]